Kikkert2012/PorousLayer_boundaryCondition/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

l1	0.983;
l2	5.1906; // 5.183 + 0.003 + 0.35*0.0013/sin(atan(0.1)) = 5.183 + 0.0076
l3	12.1906; //12.183 + 0.003 + 0.35*0.0013/sin(atan(0.1)) = 12.183 + 0.0076

h1	0.053;
h2	1;
h3	0.7;
h4	0.753;
h5	1.7;

e1	0.197;
e2	0.225;
e3	-0.197;
e4	-0.225;

vertices
(
    ($l3 $h5 $e2) 	// 0
    (0 0 $e3)
    ($l1 0 $e3)
    ($l1 $h2 $e3)
    (0 $h2 $e3)
    (0 0 $e1)		// 5 
    ($l1 0 $e1)
    ($l1 $h2 $e1)
    (0 $h2 $e1)
    ($l1 0 $e4)
    
    ($l2 0 $e4)		// 10
    ($l2 $h2 $e4)
    ($l1 $h2 $e4)
    ($l1 0 $e2)
    ($l2 0 $e2)
    ($l2 $h2 $e2)	// 15
    ($l1 $h2 $e2)
    ($l2 0 $e3)
    ($l2 0 $e1)
    ($l2 $h2 $e3)
    
    ($l2 $h2 $e1)	// 20
    ($l3 $h3 $e4)
    ($l3 $h3 $e3)
    ($l3 $h3 $e1)
    ($l3 $h3 $e2)
    ($l3 $h5 $e4)	// 25
    ($l3 $h5 $e3)
    ($l3 $h5 $e1)
    (0 $h1 $e3)
    (0 $h1 $e1)
    
    ($l1 $h1 $e3)	// 30
    ($l1 $h1 $e1)
    ($l1 $h1 $e4)
    ($l1 $h1 $e2)
    ($l2 $h1 $e4)
    ($l2 $h1 $e3)	// 35
    ($l2 $h1 $e1)
    ($l2 $h1 $e2)
    ($l3 $h4 $e4)
    ($l3 $h4 $e3)
    	
    ($l3 $h4 $e1)	// 40
    ($l3 $h4 $e2)    
);

blocks
(
    hex (28 30 3 4 29 31 7 8) (98 95 40) simpleGrading (1 1 1)
    hex (30 35 19 3 31 36 20 7) (421 95 40) simpleGrading (1 1 1)
    hex (32 34 11 12 30 35 19 3) (421 95 3) simpleGrading (1 1 1)
    hex (31 36 20 7 33 37 15 16) (421 95 3) simpleGrading (1 1 1)
    hex (35 39 26 19 36 40 27 20) (700 95 40) simpleGrading (1 1 1)		// 5
    hex (34 38 25 11 35 39 26 19) (700 95 3) simpleGrading (1 1 1)
    hex (36 40 27 20 37 41 0 15) (700 95 3) simpleGrading (1 1 1)
    hex (1 2 30 28 5 6 31 29) (98 42 40) simpleGrading (1 1763.7 1)
    hex (2 17 35 30 6 18 36 31) (421 42 40) simpleGrading (1 1763.7 1)
    hex (9 10 34 32 2 17 35 30) (421 42 3) simpleGrading (1 1763.7 1)	// 10
    hex (6 18 36 31 13 14 37 33) (421 42 3) simpleGrading (1 1763.7 1)
    hex (17 22 39 35 18 23 40 36) (700 42 40) simpleGrading (1 1763.7 1)
    hex (10 21 38 34 17 22 39 35) (700 42 3) simpleGrading (1 1763.7 1)
    hex (18 23 40 36 14 24 41 37) (700 42 3) simpleGrading (1 1763.7 1)
    
    /*hex (28 30 3 4 29 31 7 8) (98 95 40) simpleGrading (1 1 1)
    hex (30 35 19 3 31 36 20 7) (420 95 40) simpleGrading (1 1 1)
    hex (32 34 11 12 30 35 19 3) (420 95 17) simpleGrading (1 1 1292.1)
    hex (31 36 20 7 33 37 15 16) (420 95 17) simpleGrading (1 1 0.00077393)
    hex (35 39 26 19 36 40 27 20) (700 95 40) simpleGrading (1 1 1)		// 5
    hex (34 38 25 11 35 39 26 19) (700 95 17) simpleGrading (1 1 1292.1)
    hex (36 40 27 20 37 41 0 15) (700 95 17) simpleGrading (1 1 0.00077393)
    hex (1 2 30 28 5 6 31 29) (98 42 40) simpleGrading (1 1763.7 1)
    hex (2 17 35 30 6 18 36 31) (420 42 40) simpleGrading (1 1763.7 1)
    hex (9 10 34 32 2 17 35 30) (420 42 17) simpleGrading (1 1763.7 1292.1)	// 10
    hex (6 18 36 31 13 14 37 33) (420 42 17) simpleGrading (1 1763.7 0.00077393)
    hex (17 22 39 35 18 23 40 36) (700 42 40) simpleGrading (1 1763.7 1)
    hex (10 21 38 34 17 22 39 35) (700 42 17) simpleGrading (1 1763.7 1292.1)
    hex (18 23 40 36 14 24 41 37) (700 42 17) simpleGrading (1 1763.7 0.00077393)*/
    
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (1 28 29 5)
            (28 4 8 29)
            (1 2 30 28)
            (28 30 3 4)
            (5 29 31 6)
            (29 8 7 31)
            
            (30 2 9 32)
            (3 30 32 12)
            (33 13 6 31)
            (16 33 31 7)
            (32 9 10 34)
            (12 32 34 11)
            (13 33 37 14)
            (33 16 15 37)
            
            (10 21 38 34)
            (34 38 25 11)
            (24 14 37 41)
            (37 15 0 41)
        );
    }
    
    floor
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (2 6 18 17)
            (9 2 17 10)
            (6 13 14 18)
        );
    }
    beach
    {
        type wall;
        faces
        (
            (17 18 23 22)
            (10 17 22 21)
            (18 14 24 23)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 3 7 8)
            (3 19 20 7)
            (12 11 19 3)
            (7 20 15 16)
            (11 25 26 19)
            (19 26 27 20)
            (20 27 0 15)
            
            (38 39 26 25)
            (39 40 27 26)
            (40 41 0 27)
            (21 22 39 38)
            (22 23 40 39)
            (23 24 41 40)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
